{"tasks":[{"id":12475470,"content":"*496 Zachry Smart Focus (C8) - Shipping Address","description":"We hard coded these orders to pull in the site champion for each job site, as the attention line for shipments. \nWE now need to include both the site champion and the author of the order/award recipient as well. \nIs there someway to pull this into the PO for the vendor to reference?","owner":{"firstname":"Mike","lastname":"French"}},{"id":12672998,"content":"*496 Zachry Smart Focus (C8) - Shipping Address Issue #2","description":"We also have an issue with this ship to: \nthe 2nd line of the address didn't pull into PO 3561935T. \nNot sure if this will continue to happen, so can you take a look and make sure? if it is, are other site addresses effected too? can you figure out a fix?\n\nJob Site/Suggestion Group INEOS CB\n\nZACHRY INDUSTRIAL \nFM 2004 \n2 MILES SOUTH OF THE INTERSECTION OFFM2917 AND FM2004 \nALVIN TX 77511","owner":{"firstname":"Mike","lastname":"French"}},{"id":13956988,"content":"*696 JHU Carey - Reminder Email","description":"Reminder Email\no   I’m sure this question is for Christa, but is it possible to have an automated reminder email sent out to people who come to the site, place items in their bag but do not make the purchase. I am thinking something like the example I have pictured below: \nSee attached image","owner":{"firstname":"Scott","lastname":"Stowe"}},{"id":14058580,"content":"*451 NSU - Email notifier for rep (live site only)","description":"Is the web team the one who can turn on notifications for a sales rep to receive emails when an order is received by the site?","owner":{"firstname":"Ashley","lastname":"Doughty"}},{"id":15332385,"content":"*11E, *11F AECOM CANADA - Live Inventory","description":"Please open a ticket with Avetti to question how live inventory can be kept on a non-integrated site where inventory is shared between skus and sites.\n\nI have learned how to upload inventory amounts into Avetti and the thought (Mike Plourde) was that Avetti would automatically deduct as items were ordered, we would only need to load new inventory as it is received and checked in.  However, one site *11E is a credit card site and one *11F is a punch out site.  My understanding is that Avetti would not keep track of the punch out orders or deduct inventory because it is just passing through.  Also, both sites mentioned share skus....and we have an English and a French version of each sku.  I'm open to troubleshooting this with someone.  \n\nLive global inventory is important to AECOM, so this is a priority.","owner":{"firstname":"Mike","lastname":"French"}},{"id":16256666,"content":"*435  Corporate Travel update order questions","description":"In the check out when asked for the order questions we need to be able to capture at least 4 of the  4T cost center codes and at least 3 of the T3 cost center codes.    They have to fill out at least one of each.\nIf you look at web order C8FC17071900001 the T4 codes got cut off.    if it can expand that would be ideal.  if not a second, third and fourth box.  Hoping we can just expand","owner":{"firstname":"Joni","lastname":"Satterthwaite"}},{"id":17004520,"content":"AECOM EMIA Sites- payment","description":"Please see the below email:\n\nHi Kevin\nI hope you are well? Regarding the European website you created for AECOM, we are in the process of setting up a new MID to handle the Euro payments. The Gateway company is asking for the sitereference... I have one from last year which was test_btcgroupthree69378 but I was wondering if it has changed since then?\n\nThanks for your assistance in this matter,\n\nFaye Johnson | Design Manager\n020 8587 3363","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":17111139,"content":"Ingersoll Rand's President's Awards","description":"Create these as integrated google forms. they will need to email the client when responses come in. We are waiting for confirmation on if they will go on the portal site.","owner":{"firstname":"Mike","lastname":"Plourde"}},{"id":17238684,"content":"*376 BD - new disclaimer","description":"can we please add the following text to our checkout screen & order confirmation when an international country is selected ?\n\n\nPlease note that international shipments are subject to duties and customs fees above and beyond standard shipping charged by Geiger. These charges are the responsibility of the receiver and payment may be required before delivery of your package will be completed. Contact your local courier or customs office for details.","owner":{"firstname":"Rory","lastname":"McGuire"}},{"id":17542650,"content":"*451 NSU - Ship to address issue","description":"Orders are not pulling in the full ship to address. Missing street address each time. This has happened on the past three orders.\nEx 1862691 & 1866354","owner":{"firstname":"Ashley","lastname":"Doughty"}},{"id":17766319,"content":"*16A and *39A Vistana Birt tool getting and error","description":"The customer is getting a java exception.\n\nShe was pulling  report from the birt tool for employee ID 126704  when I go to pull the same report I get the same issue.","owner":{"firstname":"CPWEB","lastname":"Group"}},{"id":18225285,"content":"*11E *11F AECOM Canada - CANHU11F3","description":"This item does not have a spot for French description, attributes, or title.","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":18300579,"content":"*11A & *11B AECOM - New Category","description":"Please create following new categories:\n\nAECOM Tishman (Keyword *WEB TISHMAN)\nAECOM Hunt (Keyword *WEB HUNT)\n\nPlease keep these hidden until further notice. Thank you!","owner":{"firstname":"Jen","lastname":"Ruler"}},{"id":18595596,"content":"AECOM Compatibility issue with IE","description":"Kevin please get prepared to have the region link redirected from AECOM to a url on our sub domain geigershops.com.  Please send me the url you want to use and I can coordinate with the client to test if this will solve their issue\n\nThanks,\n\nMike\n\nMichael J Plourde, MAS, CIL\nDIRECTOR DATA AND ANALYTICS\n\n[http://artflow2.geiger.com/signature/Geiger_files/image002.png]\n70 Mt Hope Ave * Lewiston, Me 04240\nPH. 207.755.2483 * C. 207.577.7052 * www.geiger.com<http://www.geiger.com/>\n\n[http://artflow2.geiger.com/signature/Geiger_files/image004.png]<https://www.facebook.com/geiger>   [http://artflow2.geiger.com/signature/Geiger_files/image006.png] <https://twitter.com/geigergetsit>    [http://artflow2.geiger.com/signature/Geiger_files/image008.png] <https://www.linkedin.com/company/geiger>\n#geigergetsit  * IT\n\nYour name and message showcased on a promotional product has impact like no other medium.  When a promotion is executed with just the right product and a creative flair, it's called Brandspiration. No firm has won more industry awards than ours. Let us use the power of Brandspiration to help you dazzle and inspire.","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":18671744,"content":"*31B TAA & *31A TAP - Items in Search","description":"The following items are appearing for searches of the word 'pen', but this sequence of letters does not exist in the romance or the title for these items. Could you look into this please?\n\nVJM005\nVJU005\nASU003BLK\nASM003BLK\nAPM005NVY\n\nThank you!","owner":{"firstname":"Scott","lastname":"Stowe"}},{"id":18845754,"content":"*34C Pega International shipping (restricted shipping function)","description":"We can not ship S'well bottles internationally. What are the options besides adding shipping restrictions in the romance file to an item to warn the customer and possibly stop an order from coming through for a specific item with an international address?","owner":{"firstname":"CPWEB","lastname":"Group"}},{"id":18715856,"content":"IR Sites - check off items as discontinued","description":"Please see the attached SS, there is a tab for each individual site. All SKU's need to have the \"discontinued\" box checked off in the inventory screen.","owner":{"firstname":"Casey","lastname":"Conroy"}},{"id":18736530,"content":"Create a demo copy of the CRU Winter Conference site for Rob Kilgore","description":"it is OK to put this on Custer 1","owner":{"firstname":"Ashley","lastname":"Doughty"}},{"id":18773416,"content":"*33F and *33G - Valmont and Valley - New Promo Category","description":"Can you please create a Tradeshow Group Buy Category. Can you keep this hidden until 5/31 when the live date for the promo is.\n\nPlease let me know what the keyword is once it is set up.\n\nThanks!","owner":{"firstname":"Mike","lastname":"French"}},{"id":18792357,"content":"Ingersoll Rand- Need to revise POP UP window on check out pages for all cags *INTERNATIONAL & DOMESTIC*","description":"***We need to update the POP UP window for international orders on the check out page on all cags to the following: \n\nPlease note that you have selected international shipping for this order. \nYour order confirmation will show no shipping total as we will send you an email quote for approval after your order is placed. \nDuties and Taxes will not be included in the quote but will be approximately 20% of your order total and will be billed separately (invoice will be sent out within 30-45 days after the order has shipped) \n\nFor all International orders please allow an additional 7 business days to account for transit and customs.\n\nDue to new restrictions from UPS/FEDEX on AIR shipping shipments of products with lithium ion batteries a sur charge of $50.00 per box will apply to the order (this is in addition to the freight estimate emailed to you). \n\n***For Domestic shipping orders- also create a pop up (to function just like the International one we have). \n\nDue to new restrictions from UPS/FEDEX on AIR shipping shipments of products with lithium ion batteries a sur charge of $50.00 per box will apply to the order (this is in addition to the freight estimate emailed to you).\nThis sur charge will not apply if shipping GROUND method. \n\nThe POP UP window still needs to have the I accept button for the client to click to confirm acknowledgement- for both international and domestic. \n\nCags\n*38A\n*38B\n*38C\n*38D\n*38E\n*38H\n*38J\n*38L","owner":{"firstname":"Juliana","lastname":"Rua"}},{"id":18795887,"content":"*55C Milestone - re-enable password change on site","description":"password change section of site has been hidden from the users on this site in the past -- please change the site to allow for password changes.","owner":{"firstname":"Kaitlynne","lastname":"Gibson"}},{"id":18812534,"content":"Ingersoll Rand Corporate site *38A need new category /keyword -Trane Commercial Green","description":"Please create a new subcategory for *38A Trane Commercial (*WEB TB is the Green dot) \nplease name it - Controls 40th Anniversary \nkeyword to use is *WEB TB40","owner":{"firstname":"John","lastname":"Paine"}},{"id":18817326,"content":"*55B LMC - add communities to BOTH script question dropdowns","description":"Axle \nValdok \n\n\nmaintain alphabetical order","owner":{"firstname":"Kaitlynne","lastname":"Gibson"}},{"id":18817762,"content":"*11E & *11F AECOM CANADA - CANTS11F01 & cants11f02 - MISSING FRENCH ATTRIBUTES","description":"I am having trouble with the french attribute sheet creating errors.  I need the attributes uploaded, but I also need someone to show me what I'm doing wrong.","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":18846877,"content":"*17D NPD - MOQ Question","description":"Customer is asking if we can mix and match between ladies & men's shirts to equal 12 when ordering the two styles? See attached file.","owner":{"firstname":"Stella","lastname":"Duclos"}},{"id":18858520,"content":"*496 Zachry Smart Focus - address change, to job site in idea site","description":"Please update existing customer files:\n\nI changed the address for TECO Polk in Florida\n\nWas \n13031 Wyandotte Rd\nApollo Beach 33572\n\nNow \n9995 s 37 \nMulberry FL 33860.","owner":{"firstname":"Christa","lastname":"Matuszewski"}},{"id":18859772,"content":"*68U Waltco - Program Closing - Begin Shutdown/ Closing Process","description":"Please reach out to me with any questions","owner":{"firstname":"Zachary","lastname":"LeBlanc"}},{"id":18877313,"content":"*120 BFS item#CA2120023 not showing on web","description":"can you please check the back end? this is in the assortment and show on web Y so it should be showing.\n\nCA2120023GRYLO\nCA2120023GRYLP\n\nThanks!","owner":{"firstname":"Amanda","lastname":"Bryant"}},{"id":18899804,"content":"*32N Cru add hidden script question","description":"Can we please add a script question and pre-populated answer for just *32N and hide it, I need the answer to populate on the invoice for the customer.\n\nQ. Invoice for your records only\nA. Do Not Pay","owner":{"firstname":"Kelly","lastname":"Sutton"}},{"id":18900623,"content":"*33J Ocean Spray french site item upload issue","description":"6/5\nTHERE IS NO ART DISPLAYED ON WEBSITE FOR THIS WT233D008GHE\n\nwhen adding WT233D008GHE, only medium will show on site and there is no art with it either.","owner":{"firstname":"CP Art","lastname":"Group"}},{"id":18902996,"content":"*379 USHW (C8:C2) - Create new category in Nav Bar","description":"Could you please create a new category for \"Name Badges\" on the Nav bar?  Please set this up as hidden for now with a customer property that can be added to allow certain customers to order, needs to be hidden from all except Cheryl Thomas, admin, and Paula Gossett.\n\nKeyword: *WEB BADGE\n\nThanks,","owner":{"firstname":"Nikki","lastname":"Hamlin"}},{"id":18905842,"content":"*180 Oliver Wyman--duplicate items","description":"Here is a list of skus that need to be removed from the website, as it shows right now there is a duplicate image for what looks to be the header skus. We need to remove those so that the images with the drop down of logos is the only thing showing.\n\nHC8180002NAT000\tBAMBOO COASTER\tremove from assortment\nIA8180006NAT000\tECO FRIENDLY BAMBOO PEN\tremove from assortment\nSH8180003NVY000\tEROS NON- WOVEN TOTE\tremove from assortment\nHZ8180003LBR000\tFLOWER POT SET\tremove from assortment\nSH8180002BLU000\tCANVAS DAY TOTE\tremove from assortment\nVZ8180001ROY000\tDELUXE DRAWSTRING SPORTSPACK\tremove from assortment\nIA8180006NAT000\tECO FRIENDLY BAMBOO PEN\tremove from assortment\nVZ8180002BLK000\tELLEVEN MOTION 15'' COMPUTER BACKPACK\tremove from assortment\nSH8180003NVY000\tEROS NON- WOVEN TOTE\tremove from assortment\nTZ8180001NVY000\tFIDGET SPINNER\tremove from assortment\nDZ8180004BLK000\tJUNCTION 4,000 mAh POWER BANK\tremove from assortment\nTI8180001BLU000\tLINKS FIRST AID KIT\tremove from assortment\nDZ8180003ROY000\tPOWER BANK & DIGITAL DISPLAY\tremove from assortment\nSJ8180002BLU000\tRENEGADE UMBRELLA\tremove from assortment\nSJ8180004BLK000\tREVERSE OPEN UMBRELLA\tremove from assortment\nVZ8180006BLK000\tSATELLITE VERTICAL MESSENGER BAG\tremove from assortment\nSI8180001BLK000\tSPARTAN SPORT BAG\tremove from assortment\nHC8180001BLU000\tTWO-TONE COASTER\tremove from assortment\nSJ8180003BLU000\tVENTED AUTO OPEN AUTO CLOSE UMBRELLA\tremove from assortment\nVZ8180003BLK000\tVERTEX CARBON COMPUTER BACKPACK\tremove from assortment\nVZ8180005BLK000\tVERTICAL MESSENGER BAG\tremove from assortment\nGH8180001BLK000\t40 OZ. STAINLESS STEEL INSULATED EXPLORER\tremove from assortment\nGE8180003BLU000\t40 OZ. TRITAN (TM) WATER BOTTLE\tremove from assortment\nGE8180001BLU000\tMEGA TUNDRA 40 OZ. BOTTLE\tremove from assortment\nGD8180001BLU000\tPEBBLE BEACH TUMBLER - 16OZ\tremove from assortment\nGD8180002BLU000\tRIVIERA TUMBLER - 16OZ\tremove from assortment\nGE8180002BLU000\tSWIG 40 OZ. TRITAN WATER BOTTLE\tremove from assortment\nVZ8180001ROY000\tDELUXE DRAWSTRING SPORTSPACK\tremove from assortment\nSG8180001BLU000\tFOTO VISION BEACH TOWEL\tremove from assortment\nVZ8180007WHT000\tLARGE TEE POUCH\tremove from assortment\nSJ8180002BLU000\tRENEGADE UMBRELLA\tremove from assortment\nSJ8180004BLK000\tREVERSE OPEN UMBRELLA\tremove from assortment\nSJ8180003BLU000\tVENTED AUTO OPEN AUTO CLOSE UMBRELLA\tremove from assortment\nVZ2180004BLK000\tVICTORINOX BIG BEN\tremove from assortment","owner":{"firstname":"Amy","lastname":"Law"}},{"id":18906177,"content":"*51C HMH - Links","description":"Can you have the safety glasses and vests be clickable to their product pages. Thx\nhttps://hyundaimaterialhandling.geigershops.com/","owner":{"firstname":"John","lastname":"Paine"}},{"id":18906535,"content":"*49i Univest reopen site 9:00 AM","description":"We can remove the Maintenance page and reopen the site on Monday at 9:00 AM","owner":{"firstname":"Joni","lastname":"Satterthwaite"}},{"id":18907274,"content":"*112 Make A Wish Chapters Marketplace (C82) Site Issue","description":"The site will not allow you to add items to the cart.  When choosing an item and attempting to add it to the cart, the site automatically reverts back to the home page.","owner":{"firstname":"Jennifer","lastname":"Gomm"}},{"id":18910280,"content":"*228 CSC Palos (C8) - Needs Category Added","description":"I would like to add a category under the Promotional Items tab.  Please add L&D as a category in this section.","owner":{"firstname":"Jennifer","lastname":"Gomm"}},{"id":18918237,"content":"*159 Hancock Whitney Procurement Site (C8) - Items not syncing to site","description":"On the *159 Whitney Hancock procurement site, I have added, removed and re-added the below items several times and cannot get them loaded onto the site.  Could someone take a look for me please?\nItem           \nDB2159001WHT000 - Hancock Whitney Notepad - Pack of 3\nBZ8159001WHT000 - Name Badge\nBZ8159002WHT000 - Name Badge\nBZ8159003WHT000 - Name Badge\nBZ8159004WHT000 - Name Badge","owner":{"firstname":"Jennifer","lastname":"Gomm"}},{"id":18919405,"content":"*399 Hubbell - Calendar Category - Product Updates","description":"Please update the calendar items within the Calendar category to the items shown on page 2 of the attached. \nThe linked order form will also need to be updated with the order form attached.","owner":{"firstname":"CP Art","lastname":"Group"}},{"id":18927746,"content":"*478 Banner Bulk Sales website item update","description":"on the banner bulk non integrated site we need to update the min order amount from 300 to 325 \nTROPICAL PEN\nCode: 55583-6202","owner":{"firstname":"Joni","lastname":"Satterthwaite"}},{"id":18931338,"content":"*49i Univest item won' show on site","description":"PORT AUTHORITY LADIES CARDIGAN SWEATER\nCode: WS249I008GRY\n\nThe small size won't show up,  I have removed and re added giving it time but no luck can  you see it on the backend?  Are you able to manually push it up?","owner":{"firstname":"Joni","lastname":"Satterthwaite"}},{"id":18942202,"content":"*361  NCNU FOS items","description":"these items have to be Free of sale but I can't get the .01 not to be charged.  I was told there is something on the site that needs to be done.  Again.  these should all be free\n\nProduct Code Stock Unit Product Description\nWA2361001NVY6XL EA MENS VOLUNTEER T-SHIRT 6XL\nWR2361002NVY2XL EA LADIES VOLUNTEER T-SHIRT 2XL\nWR2361002NVY3XL EA LADIES VOLUNTEER T-SHIRT 3XL\nWR2361002NVYLRG EA LADIES VOLUNTEER T-SHIRT LARGE\nWR2361002NVYMED EA LADIES VOLUNTEER T-SHIRT MEDIUM\nWR2361002NVYSMA EA LADIES VOLUNTEER T-SHIRT SMALL\nWR2361002NVYXLG EA LADIES VOLUNTEER T-SHIRT XLARGE\nWR2361002NVYXSM EA LADIES VOLUNTEER T-SHIRT XSMALL","owner":{"firstname":"CPWEB","lastname":"Group"}},{"id":18944592,"content":"*374 Methodist add property to payroll ded site","description":"Please add a property t/f to the *374 payroll deduct users so when a person logs on and has been deactivated a notification box pops up stating \"your account has been deactivated please contact your payroll department to reactivate\"","owner":{"firstname":"John","lastname":"Paine"}},{"id":18944815,"content":"*33M Valmont Utility item# VZ833M002BLK000 not showing price correctly on web","description":"Hi CP Web- the price for this item# VZ833M002BLK000 is not showing correctly on the web... it has two prices listed when viewing in the bags category... once in the item itself the price is correct. looks like something isn't correct. Price is right in item file i checked and no pricing in assortment to mess it up.\nThanks!","owner":{"firstname":"CPWEB","lastname":"Group"}}]}